<template>
    <AppLayout>
        <body style="overflow: hidden">
            <div class="2xl:container 2xl:mx-auto lg:py-16 lg:px-20 md:py-12 md:px-6 py-9 px-4">
                <div class="flex flex-col lg:flex-row justify-between gap-8">
                    <div class="w-full lg:w-5/12 flex flex-col justify-center">
                        <h1 class="text-3xl lg:text-4xl font-bold leading-9 text-gray-800 pb-4 underline">เกี่ยวกับเรา</h1>
                        <ul class="font-normal text-base leading-6 text-gray-600 list-disc">
                            <div class="text-lg text-blue-500 font-bold">วิสัยทัศน์</div>
                            <li class="ml-4 mb-2">เป็นผู้นำทางอายุรศาสตร์ระดับสากล</li>
                            <div class="text-lg text-blue-500 font-bold">พันธกิจ</div>
                            <li class="ml-4 mb-2">องค์กรชั้นเลิศทางอายุรศาสตร์ ในการผลิตแพทย์ที่สมบูรณ์แบบ สร้างองค์ความรู้และบริการที่ได้มาตรฐานระดับนานาชาติ</li>
                            <div class="text-lg text-blue-500 font-bold">คำขวัญ</div>
                            <li class="ml-4">ภาคภูมิ ทุ่มเทให้ ร่วมแรงใจ ได้ผลงาน "Pride Passion Participation and Productivity"</li>
                        </ul>
                    </div>
                    <div class="w-full lg:w-8/12">
                        <!-- <img class="w-full h-full" src="https://i.ibb.co/FhgPJt8/Rectangle-116.png" alt="A group of People" /> -->
                        <!-- <img class="w-full h-full" :src="`${baseUrl}/images/med_building.jpg`" alt="A group of People" /> -->
                        <img class="w-full h-full" src="../../asset/images/med_building.jpg" alt="A group of People" />
                    </div>
                </div>

                <div class="flex flex-col justify-between gap-8 pt-12">
                    <!-- <div class="w-full lg:w-5/12 flex flex-col justify-center"> -->
                    <div class="w-full flex flex-col justify-center">
                        <h1 class="text-3xl lg:text-4xl font-bold leading-9 text-gray-800 pb-4 underline">ประวัติภาควิชา</h1>
                        <div class="inline-block font-normal text-base leading-6 text-gray-600 mb-3 indent-8">
                            ภาควิชาอายุรศาสตร์ อาจนับได้ว่าเริ่มมีขึ้นตั้งแต่มีการเปิดสอนหลักสูตรแพทย์แผนปัจจุบันขึ้นในโรงพยาบาลศิริราชจากจุดเริ่มต้นของการสอน 
                            ภาควิชาอายุรศาสตร์จึงได้เปิดการฝึกอบรมระดับหลังปริญญาให้แก่แพทยที่มีความต้องการเป็นแพทย์เฉพาะทางอายุรศาสตร์
                            วิชาทางอายุรศาสตร์ คือวิชา Materia Medical และ Practice of Medicine โดยวิชาอายุรศาสตร์ก็ได้รับการจัดให้สอนอยู่ในหลักสูตรแพทย์มาตลอด 
                            ระยะต่อมาก็มีครูแพทย์ไทยอีกหลายท่านที่ได้รับการศึกษาอบรมจากต่างประเทศกลับมาสอนวิชาอายุรศาสตร์ และเมื่อมีการปรับปรุงหลักสูตรการศึกษาแพทย์ไทยให้เป็นระดับปริญญา 
                            โดยความร่วมมือของมูลนิธิร็อคกี้เฟลเลอร์ ศาสตราจารย์นายแพทย์ William Harvey Perkins ได้มารับตำแหน่งหัวหน้าแผนก "อายุรศาสตร์" ในพ.ศ. 2469 และในพ.ศ. 2473 
                            ศาสตราจารย์พระอัพภันตราพาธพิศาลก็ได้เป็นหัวหน้าแผนก ต่อมาในสมัยแรกของการเรียนวิชาอายุรศาสตร์นั้น มีครูแพทย์ทั้งชาวต่างประเทศและชาวไทยเพียงไม่กี่ท่าน 
                            แต่เนื่องจากกระบวนวิชาความรู้ต่างๆ ทางอายุรศาสตร์ได้มีความก้าวหน้าไปอย่างกว้างขวางอีกทั้งต้องการผู้เชี่ยวชาญเฉพาะกระบวนวิชาได้รับผิดชอบดูแล ในปีพ.ศ. 2488 
                            ศาสตราจารย์นายแพทย์ประเสริฐ กังสดาลย์ หัวหน้าแผนกอายุรศาสตร์ท่านที่ 3 ก็ได้เริ่มจัดแบ่งให้มีหน่วยต่างๆ 10 หน่วย ซึ่งในพ.ศ. 2512 
                            ก็ได้ยกฐานะแผนกขึ้นเป็นภาควิชาและยกหน่วยขึ้นเป็นสาขาวิชา
                            <div class="inline-block text-gray-300 indent-2" :class="{ 'hidden' : readMore }">
                                ความเจริญก้าวหน้า ของภาควิชาฯได้มีมากขึ้นเป็นลำดับ จำนวนสาขาวิชา...
                                <button class="px-1 rounded-md text-blue-700 hover:text-blue-400" @click="readMore = !readMore">อ่านเพิ่มเติม</button>
                            </div>
                        </div>

                        

                        <div :class="{ 'hidden' : !readMore }">
                            <p class="font-normal text-base leading-6 text-gray-600 mb-3 indent-8">
                                ความเจริญก้าวหน้า ของภาควิชาฯได้มีมากขึ้นเป็นลำดับ จำนวนสาขาวิชาก็ได้มีเพิ่มมากขึ้นและได้มีการขยายสาขาวิชาเดิม ของภาควิชาอายุรศาสตร์ 3 สาขาวิชา แยกออกตั้งเป็นภาควิชาใหม่คือ ภาควิชาเวชศาสตร์ป้องกันและสังคม ภาควิชาจิตเวชศาสตร์ และภาควิชาตจวิทยา
                            </p>

                            <div class="flex flex-col lg:flex-row items-center">
                                <!-- <img class="w-96 h-60 shrink-0 px-4" :src="`${baseUrl}/images/doctor-2568481_960_720.jpg`" alt="A group of People" /> -->
                                <img class="w-96 h-60 shrink-0 px-4" src="../../asset/images/doctor-2568481_960_720.jpg" alt="A group of People" />
                                <p class="mt-2 lg-mt-0 font-normal text-base leading-6 text-gray-600 mb-3 indent-8">
                                    ในปัจจุบันภาควิชาอายุรศาสตร์ ประกอบด้วย 18 สาขาวิชา รับผิดชอบการสอนทั้งภาคบรรยาย และภาคปฏิบัติ ให้แก่ นักศึกษาแพทย์ ชั้นปีที่ 3,4,5 และ 6 เนื่องจากความต้องการของอายุรแพทย์ของประเทศได้มีเพิ่มมากขึ้น โดยเปิดการฝึกอบรมระดับหลังปริญญาให้แก่แพทย์ที่มี ความต้องการเป็นแพทย์เฉพาะทางอายุรศาสตร์ โดยเปิดหลักสูตรแพทย์ประจำบ้านขึ้นใน พ.ศ. 2505 ซึ่งได้มีการขยายงานการสอนแพทย์ประจำบ้าน โดยเปิดหลักสูตรการฝึกอบรมแพทย์เฉพาะทางอีกหลายหลักสูตร ได้แก่ สาขาประสาทวิทยา สาขาโลหิตวิทยา สาขาตจวิทยา สาขาหทัยวิทยา สาขาโรคระบบทางเดินหายใจและวัณโรค สาขาวักกะวิทยา สาขาโรคระบบทางเดินอาหาร สาขาโรคข้อและรูมาติสซั่ม สาขาโรคระบบต่อมไร้ท่อ และเมตาบอลิสม และสาขาโรคติดเชื้อในปัจจุบันภาควิชาอายุรศาสตร์ มีอาจารย์ 141 ท่าน อาจารย์ในภาควิชาฯเป็นผู้มีความรู้ ความสามารถ ทั้งในด้านการเรียนการสอน วิจัย บริการผู้ป่วยและด้านบริหาร ทางด้านบริหารนั้น คณาจารย์ในภาควิชาฯ ได้รับเลือกให้ดำรงตำแหน่งสำคัญๆ หลายตำแหน่ง อาทิเช่น รองอธิการบดี มหาวิทยาลัยมหิดล รองผู้อำนวยการโรงพยาบาลศิริราช คณบดีคณะแพทยศาสตร์ศิริราชพยาบาล รองคณบดีคณะแพทยศาสตร์ศิริราชพยาบาล ผู้ช่วยคณบดีคณะแพทยศาสตร์ศิริราชพยาบาล คณะกรรมการ สภาอาจารย์มหาวิทยาลัยมหิดล คณะกรรมการสภาอาจารย์คณะแพทยศาสตร์ศิริราช พยาบาล เป็นต้น รวมทั้งเป็นนายกสมาคมต่าง ๆ ประธานและกรรมการของราชวิทยาลัยอายุรแพทย์แห่งประเทศไทย และอธิการบดีมหาวิทยาลัยมหิดล
                                </p>
                            </div>

                            <!-- <p class="font-normal text-base leading-6 text-gray-600 mb-3 indent-8">
                                ในปัจจุบันภาควิชาอายุรศาสตร์ ประกอบด้วย 18 สาขาวิชา รับผิดชอบการสอนทั้งภาคบรรยาย และภาคปฏิบัติ ให้แก่ นักศึกษาแพทย์ ชั้นปีที่ 3,4,5 และ 6 เนื่องจากความต้องการของอายุรแพทย์ของประเทศได้มีเพิ่มมากขึ้น โดยเปิดการฝึกอบรมระดับหลังปริญญาให้แก่แพทย์ที่มี ความต้องการเป็นแพทย์เฉพาะทางอายุรศาสตร์ โดยเปิดหลักสูตรแพทย์ประจำบ้านขึ้นใน พ.ศ. 2505 ซึ่งได้มีการขยายงานการสอนแพทย์ประจำบ้าน โดยเปิดหลักสูตรการฝึกอบรมแพทย์เฉพาะทางอีกหลายหลักสูตร ได้แก่ สาขาประสาทวิทยา สาขาโลหิตวิทยา สาขาตจวิทยา สาขาหทัยวิทยา สาขาโรคระบบทางเดินหายใจและวัณโรค สาขาวักกะวิทยา สาขาโรคระบบทางเดินอาหาร สาขาโรคข้อและรูมาติสซั่ม สาขาโรคระบบต่อมไร้ท่อ และเมตาบอลิสม และสาขาโรคติดเชื้อในปัจจุบันภาควิชาอายุรศาสตร์ มีอาจารย์ 141 ท่าน อาจารย์ในภาควิชาฯเป็นผู้มีความรู้ ความสามารถ ทั้งในด้านการเรียนการสอน วิจัย บริการผู้ป่วยและด้านบริหาร ทางด้านบริหารนั้น คณาจารย์ในภาควิชาฯ ได้รับเลือกให้ดำรงตำแหน่งสำคัญๆ หลายตำแหน่ง อาทิเช่น รองอธิการบดี มหาวิทยาลัยมหิดล รองผู้อำนวยการโรงพยาบาลศิริราช คณบดีคณะแพทยศาสตร์ศิริราชพยาบาล รองคณบดีคณะแพทยศาสตร์ศิริราชพยาบาล ผู้ช่วยคณบดีคณะแพทยศาสตร์ศิริราชพยาบาล คณะกรรมการ สภาอาจารย์มหาวิทยาลัยมหิดล คณะกรรมการสภาอาจารย์คณะแพทยศาสตร์ศิริราช พยาบาล เป็นต้น รวมทั้งเป็นนายกสมาคมต่าง ๆ ประธานและกรรมการของราชวิทยาลัยอายุรแพทย์แห่งประเทศไทย และอธิการบดีมหาวิทยาลัยมหิดล
                            </p> -->

                            <p class="font-normal text-base leading-6 text-gray-600 mb-3 indent-8">
                                นอกจากนี้ คณาจารย์ในภาควิชาฯ ยังมีผลงานด้านการแต่งตำรา ทั้งภาษาไทย และภาษาต่างประเทศในลักษณะ ของตำราอายุรศาสตร์ที่อาจารย์ในภาควิชาฯ ร่วมกันเขียนและตำราเฉพาะวิชา ซึ่งเขียนร่วมกับแพทย์ผู้เชี่ยวชาญของสถาบันอื่นๆ ตำราเหล่านี้ ได้รับการยอมรับกันอย่างแพร่หลายและได้รับรางวัล ในระดับคณะและมหาวิทยาลัยทางด้านงานสอน คณาจารย์ของภาควิชาอายุรศาสตร์ ได้ทุ่มเท ความสามารถ และอุทิศเวลาในการดูแลอบรมสั่งสอนนักศึกษาแพทย์ เพื่อให้เรียนจบไปเป็นแพทย์ผู้มีทั้งความรู้ความสามารถและความรับผิดชอบ ต่อหน้าที่การงาน ผลแห่งความเสียสละ และความรักในศิษย์ จึงทำให้อาจารย์หลายท่านในภาควิชาฯ ได้รับการยกย่องให้เป็นที่ประจักษ์รับเลือก ให้ได้รับรางวัลอาจารย์ดีเด่นจากสภาอาจารย์ศิริราช รางวัลเจ้าพระยาพระเสด็จสุเรนทราธิบดีจากคณะแพทยศาสตร์ศิริราชพยาบาล รางวัลตัวอย่าง จากสภาคณาจารย์ มหาวิทยาลัยมหิดล และรางวัลมหาวิทยาลัยมหิดล สาขาความเป็นครู ซึ่งถือเป็นเกียรติยศอย่างสูงและเป็นแบบอย่าง ให้แก่อาจารย์ท่านอื่นๆ ได้ถือปฏิบัติต่อไปทางด้านวิชาการ คณาจารย์ของภาควิชาอายุรศาสตร์ ได้รับแต่งตั้งให้ดำรงตำแหน่งศาสตราจารย์ 12 ท่าน โดย เป็นศาสตราจารย์ ระดับ 11 จำนวน 4 ท่าน ศาสตราจารย์ระดับ 10 จำนวน 6 ท่าน ศาสตราจารย์คลินิก 2 ท่าน รองศาสตราจารย์ 55 ท่าน และผู้ช่วยศาสตราจารย์ 32 ท่าน ในขณะนี้ยังมีอาจารย์ที่ได้รับทุนไปศึกษาและฝึกอบรมต่อในต่างประเทศ จำนวน 15 ท่าน ซึ่งจะได้กลับมาเป็นกำลังสำคัญของภาควิชาฯ และคณะฯ
                            </p>

                            <p class="font-normal text-base leading-6 text-gray-600 mb-3 indent-8">
                                ต่อไปในอนาคต ในด้านผลงานทางวิชาการของคณาจารย์ในภาควิชานั้น งานวิจัยของอาจารย์ที่ได้รับการตีพิมพ์ในวารสารทั้งในประเทศและต่างประเทศมีจำนวนหลายร้อยเรื่องและยังมีผลงานวิจัยยอดเยี่ยม ที่ได้รับรางวัลระดับคณะแพทยศาสตร์ศิริราชพยาบาล มหาวิทยาลัยมหิดล จากสภาวิจัยแห่งชาติ รวมทั้งรางวัลมหิดล บี บราวน์ ซึ่งเป็นความภาคภูมิใจอย่างยิ่งของภาควิชาอายุรศาสตร์ ในด้านการบริการผู้ป่วย แต่เดิมนั้น หอผู้ป่วยสามัญของภาควิชาฯ ได้กระจัดกระจายไปอยู่ในตึกต่างๆ ซึ่งทำให้เกิดความยากลำบากและไม่สะดวก ในการดูแลบริหารจัดการ เมื่อคณะฯ ได้รับงบประมาณ สร้างตึกอัษฎางค์ใหม่สูง 12 ชั้น ขึ้นมาแทนตึกอัษฎางค์เดิม ภาควิชาฯ จึงได้ดำริที่จะรวบรวมสำนักงานภาควิชาฯ และสำนักงานสาขาวิชาฯ ต่างๆ บางส่วน ตลอดจนหออภิบาลผู้ป่วย และหอผู้ป่วยสามัญ โดยมีการตกแต่ง และจัดหาครุภัณฑ์ต่างๆ มาตามลำดับ จนเปิดบริการได้ครบทุกชั้น ใน พ.ศ. 2538 ขณะนี้ในตึกอัษฎางค์ มีหอผู้ป่วยสามัญรวม 10 หอ เป็นหอผู้ป่วยชาย 5 หอ และหอผู้ป่วยหญิง 5 หอ มีเตียงรับผู้ป่วยสามัญรวม 196 เตียง มีหออภิบาล 4 หอ ได้แก่ ICU (Intensive Care Unit), RCU ( Respiratory Care Unit ) , CCU ( Coronary Care Unit ) และ ICCU ( Intermediate Cardiac Care Unit ) และยังมีศูนย์ปลูกถ่ายไขกระดูกจุฬาภรณ์ซึ่งเปิดเมื่อ พ.ศ. 2529 รวมทั้งห้องประชุม และห้องสมุดของภาควิชาฯ
                            </p>

                            <p class="font-normal text-base leading-6 text-gray-600 mb-3 indent-8">
                                สรุปว่า ภาควิชาอายุรศาสตร์ได้มีความเจริญก้าวหน้ามากขึ้นเป็นลำดับ นับตั้งแต่ ปี พ.ศ. 2469 ซึ่งมีศาสตราจารย์นายแพทย์ William Harvey Perkins เป็นหัวหน้าภาควิชาอายุรศาสตร์คนแรกจนถึงปัจจุบันนับเป็นเวลา 92 ปี คณาจารย์ของภาควิชาฯ รวมทั้งสิ้น 141 คน ได้ทุ่มเทความรู้ความสามารถและอุทิศเวลาในการดูแลอบรมสั่งสอนนักศึกษาแพทย์ เพื่อให้เรียนจบไปเป็นแพทย์ที่ดีมีคุณภาพและในด้านการให้บริการรักษาพยาบาลผู้ป่วย ภาควิชาฯ ได้ปรับปรุงห้องตรวจโรคอายุรศาสตร์ใหม่ทั้งหมด ทั้งนี้เพื่อประโยชน์อย่างสูงสุดสำหรับผู้ป่วยที่มารับการตรวจรักษาในโรงพยาบาลศิริราช คณาจารย์และบุคลากรในภาควิชาฯ ต่างมีความมุ่งมั่นอย่างแรงกล้าที่จะปฎิบัติหน้าที่การงานอย่างเต็มกำลังความสามารถ เพื่อทำคุณประโยชน์สร้างชื่อเสียงเกียรติภูมิให้แก่ภาควิชาอายุรศาสตร์ คณะแพทยศาสตร์ศิริราชพยาบาล มหาวิทยาลัยมหิดลต่อไป
                            </p>

                            <button class=" w-28 px-1 rounded-md text-blue-700 hover:text-blue-400" @click="readMore = !readMore">ซ่อนเนื้อหา</button>
                        </div>
                    
                    </div>
                    <!-- <div class="w-full lg:w-8/12 lg:pt-8">
                        <div class="grid md:grid-cols-4 sm:grid-cols-2 grid-cols-1 lg:gap-4 shadow-lg rounded-md">
                            <div class="p-4 pb-6 flex justify-center flex-col items-center">
                                <img class="md:block hidden" src="https://i.ibb.co/FYTKDG6/Rectangle-118-2.png" alt="Alexa featured Image" />
                                <img class="md:hidden block" src="https://i.ibb.co/zHjXqg4/Rectangle-118.png" alt="Alexa featured Image" />
                                <p class="font-medium text-xl leading-5 text-gray-800 mt-4">Alexa</p>
                            </div>
                            <div class="p-4 pb-6 flex justify-center flex-col items-center">
                                <img class="md:block hidden" src="https://i.ibb.co/fGmxhVy/Rectangle-119.png" alt="Olivia featured Image" />
                                <img class="md:hidden block" src="https://i.ibb.co/NrWKJ1M/Rectangle-119.png" alt="Olivia featured Image" />
                                <p class="font-medium text-xl leading-5 text-gray-800 mt-4">Olivia</p>
                            </div>
                            <div class="p-4 pb-6 flex justify-center flex-col items-center">
                                <img class="md:block hidden" src="https://i.ibb.co/Pc6XVVC/Rectangle-120.png" alt="Liam featued Image" />
                                <img class="md:hidden block" src="https://i.ibb.co/C5MMBcs/Rectangle-120.png" alt="Liam featued Image" />
                                <p class="font-medium text-xl leading-5 text-gray-800 mt-4">Liam</p>
                            </div>
                            <div class="p-4 pb-6 flex justify-center flex-col items-center">
                                <img class="md:block hidden" src="https://i.ibb.co/7nSJPXQ/Rectangle-121.png" alt="Elijah featured image" />
                                <img class="md:hidden block" src="https://i.ibb.co/ThZBWxH/Rectangle-121.png" alt="Elijah featured image" />
                                <p class="font-medium text-xl leading-5 text-gray-800 mt-4">Elijah</p>
                            </div>
                        </div>
                    </div> -->
                </div>
            </div>
        </body>
    </AppLayout>
</template>

<script setup>
import { ref } from 'vue';

const readMore = ref(false)
const baseUrl = ref(base_url)

</script>

<style>

</style>